fovezea/reTerminal-E1003/sdkconfig.defaults
##########################################################################
# If you edit this file, delete sdkconfig to force a rebuild from defaults.
##########################################################################

#
# Target: ESP32-S3
#
CONFIG_IDF_TARGET="esp32s3"

#
# Flash
#
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

#
# PSRAM (Octal / OPI PSRAM)
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

#
# CPU
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

#
# FreeRTOS
#
CONFIG_FREERTOS_HZ=1000

#
# Partition table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

#
# Console — UART0 (GPIO43 TX / GPIO44 RX via USB-UART bridge)
# The reTerminal E1003 uses an external USB-UART bridge chip, not the
# ESP32-S3's internal USB Serial/JTAG (those pins are used for I2C0).
#
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

#
# LVGL — monochrome for e-Paper
#
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_DRAW_SW_SUPPORT_L1=y
CONFIG_LV_MEM_SIZE_KILOBYTES=256
CONFIG_LV_USE_MALLOC_MEMPOOL=y
CONFIG_LV_SPRINTF_USE_FLOAT=y

#
# LVGL fonts — enable sizes 20+
#
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y

#
# Task watchdog — e-Paper ops are slow
#
CONFIG_ESP_TASK_WDT_TIMEOUT_S=120

#
# Log level
#
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
